app/Http/helper.php

select * from `countries`
---
    function getCountries(){
        $countries = Country::all();