app/Http/Controllers/CountryController.php

    public function index()
    {
<<<<<<< Updated upstream
        $countries = Country::orderBy('id','asc')->pagination(5);
        return view('countries.index', compact('countries'));
=======
        $search = null;
        if ($request->exists('search')) {
            $search  = $request->search;
            $countries = Country::where('country_name', 'LIKE', $search . '%')->paginate(5);
        } else {
            $countries = Country::orderBy('id', 'asc')->paginate(5);
---
select * from `countries` where `country_name` LIKE 'a%' limit 5 offset 5
select count(*) as aggregate from `countries` where `country_name` LIKE 'a%'
select count(*) as aggregate from `countries`