app/Http/Controllers/DistrictController.php

    public function index(Request $request)
    {
        $search = null;
        if ($request->exists('search')) {
            $search  = $request->search;
            $districts = District::where('district_name', 'LIKE', $search . '%')->paginate(15);
        } else {
            $districts = District::orderBy('id', 'asc')->paginate(15);
---
select * from `districts` order by `id` asc limit 15 offset 0
select count(*) as aggregate from `districts`