app/Http/Controllers/ProvinceController.php

    public function index(Request $request)
    {

        $search = null;
        if ($request->exists('search')) {
            $search  = $request->search;
            $provinces = Province::where('province_name', 'LIKE', $search . '%')->paginate(15);
        } else {
            $provinces = Province::orderBy('id', 'asc')->paginate(15);
---
select * from `provinces` order by `id` asc limit 15 offset 0
select count(*) as aggregate from `provinces`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'country_id' =>  "required",
            'province_name' => 'required|max:255',
        ]);
        // return response()->json($request->all());
        if (Country::find($request->country_id))
            Province::create($validatedData);
---
insert into `provinces` (`country_id`, `province_name`, `updated_at`, `created_at`) values ('2', 'asd', '2023-04-29 06:36:24', '2023-04-29 06:36:24')