app/Http/Controllers/RoleController.php

    public function index()
    {
        $roles = Role::paginate(10);
---
select * from `roles` limit 10 offset 0
select count(*) as aggregate from `roles`